---
title: MultipleValuesIndicationSettings
classe: Autodesk.Revit.DB.MultipleValuesIndicationSettings
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# MultipleValuesIndicationSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean Custom { get; set; }` | `multipleValuesIndicationSettings.Custom` | Boolean |
| `String CustomValue { get; set; }` | `multipleValuesIndicationSettings.CustomValue` | String |
| `String Value { get; }` | `multipleValuesIndicationSettings.Value` | String |
| `MultipleValuesIndicationSettings GetMultipleValuesIndicationSettings(Document)` | `MultipleValuesIndicationSettings.GetMultipleValuesIndicationSettings(cda)` | MultipleValuesIndicationSettings |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```